--Laboratorna Robota
--Valko Kateryna
--KN-31 group 2
--Variant №1

    ----------------------------
    -- Task 1
    -- навести приклад виразу типу:
    -- ([Integer],[String])
    -- ...


a = [([1, 2, 3], ["Hello", "Katia"])]
b = [([1, 5], ["Katia"])]
----------------------------
    -- Task 2
-- Функцiя приймає три числа i перевiряє, чи значення першого з них
-- знаходиться мiж значеннями двох iнших.

task2 :: Integer -> Integer -> Integer -> Bool
task2 x y z =  x <= y && y <=  z    


-- Висновок:
-- На даній лабораторній роботі ми ознайомитись з основними типами даних мови Haskell.
-- Набули навичок роботи з iнтерпретатором ghci.
-- Ознайомилися зi структурою та функцiями Glasgow Haskell Compiller. 